### Python
##### -Pandas (Panel Data - this is used for data trasnformation)
##### -NumPy (Numerical Python - this package is used for mathematical or numerical operations)
##### -Scikit Learn - This package is consist of all the Machine Learning techniques including algorithms,evalutaion metrices, preprocessing functions etc
##### -Matplotlib/Seaborn - These packages are used for data visualization
#### - Natural Language Toolkit (nltk)  - This package is used for NLP tasks

##### Anaconda - Data Science package- All the ML or DS packages are pre-installed


### Important prerequisties in python
##### -collections - list,tuple,set,dict
##### -lambda and map function
##### -functions

In [1]:
#list
l1 = [1,2,3,4,5]

In [2]:
l3 = []
for x in range(0,50,5):
    l3.append(x)

In [3]:
l3

[0, 5, 10, 15, 20, 25, 30, 35, 40, 45]

In [4]:
#list comprehension

l2 = [x for x in range(0,50,5)]

In [5]:
l2

[0, 5, 10, 15, 20, 25, 30, 35, 40, 45]

In [7]:
l2[0] = 100

In [8]:
l2[1] = 100

In [9]:
l2

[100, 100, 10, 15, 20, 25, 30, 35, 40, 45]

In [10]:
l2.append('Christy')

In [11]:
l2

[100, 100, 10, 15, 20, 25, 30, 35, 40, 45, 'Christy']

In [12]:
l2[-1]

'Christy'

In [13]:
l2[-1] = 'India'

In [14]:
l2

[100, 100, 10, 15, 20, 25, 30, 35, 40, 45, 'India']

In [15]:
l2[-1]

'India'

In [16]:
l2[-2]

45

In [17]:
l2[-3]

40

In [18]:
len(l2)

11

In [19]:
l2[len(l2)-1]

'India'

In [20]:
l2[-2:]

[45, 'India']

In [21]:
l2[0]

100

In [22]:
l2[1]

100

In [23]:
l2[2]

10

In [24]:
l2[-1]

'India'

In [25]:
l2[-2]

45

### Features of List

#### 1.Hetrogenious
#### 2.Mutable
#### 3.Ordered and indexed
#### 4.Can have duplicates

In [33]:
#Set
s1 = {1,5,3,3,2,4}

In [34]:
s1

{1, 2, 3, 4, 5}

In [35]:
type(s1)

set

In [36]:
len(s1)

5

In [37]:
s1.add(2)

In [38]:
s1

{1, 2, 3, 4, 5}

In [39]:
s1.add("hello")

In [40]:
s1

{1, 2, 3, 4, 5, 'hello'}

In [42]:
s1.add(7)
s1

{1, 2, 3, 4, 5, 7, 'hello'}

In [43]:
s1.add(6)
s1

{1, 2, 3, 4, 5, 6, 7, 'hello'}

In [44]:
s1[0]

TypeError: 'set' object is not subscriptable

In [45]:
s1[0:3]

TypeError: 'set' object is not subscriptable

### Features of Set

#### 1.Hetrogenious
#### 2.Mutable
#### 3.not ordered or indexed
#### 4.Does not contain duplicates

In [46]:
#Tuple
t1 = (1,2,3,3,5.65,"hello")

In [47]:
t1

(1, 2, 3, 3, 5.65, 'hello')

In [48]:
t1[0]

1

In [49]:
t1[0]=10

TypeError: 'tuple' object does not support item assignment

In [50]:
t1[0:3]

(1, 2, 3)

In [51]:
t1[-1]

'hello'

In [52]:
t1 = (1,2,3,[1,2,3])

In [53]:
t1

(1, 2, 3, [1, 2, 3])

In [54]:
t1[3]

[1, 2, 3]

In [55]:
t1[3][0]=100

In [56]:
t1

(1, 2, 3, [100, 2, 3])

### Features of Tuple

#### 1.Hetrogenious
#### 2.Immutable
#### 3.ordered
#### 4.Can contain duplicates

In [59]:
#Dictionary
#Dictionary is a key value pair

d1 = {"name":"Christy",
     "nationality":"Indian",
     "native":'Indian',
     "age":27,
     "age":26}

In [60]:
d1

{'name': 'Christy', 'nationality': 'Indian', 'native': 'Indian', 'age': 26}

In [62]:
d1['age'] = 27

In [63]:
d1['name'] = "christy"

In [64]:
d1['native'] = 'Kottayam'

In [65]:
d1['current location'] = 'Ernakulam'

In [66]:
d1['likes'] = "Football"

In [67]:
d1.update({'job':'nothing'})

In [68]:
del d1['likes']

In [69]:
d1

{'name': 'christy',
 'nationality': 'Indian',
 'native': 'Kottayam',
 'age': 27,
 'current location': 'Ernakulam',
 'job': 'nothing'}

In [74]:
d1[0]

KeyError: 0

In [71]:
d1['name']

'christy'

In [72]:
d1['age']

27

In [73]:
d1

{'name': 'christy',
 'nationality': 'Indian',
 'native': 'Kottayam',
 'age': 27,
 'current location': 'Ernakulam',
 'job': 'nothing'}

### Features of Dict

#### 1.Hetrogenious
#### 2.Mutable
#### 3.Indexed but not ordered
#### 4.Can contain duplicates in values, not in keys

In [75]:
text = "christy111"

In [76]:
text

'christy111'

In [77]:
text[0]

'c'

In [78]:
text[0] = "A"  #string is immutable

TypeError: 'str' object does not support item assignment

In [79]:
text = "aaaabbbccccdddd1234"

In [80]:
text

'aaaabbbccccdddd1234'

In [81]:
text[0]

'a'

In [82]:
text[0:4] #index 0 to 3 are included,4 is excluded

'aaaa'

In [83]:
text[0] = "P"

TypeError: 'str' object does not support item assignment

In [84]:
type(text)  #str is the data type for string

str

### Features of String

#### 1.Hetrogenious
#### 2.Immutable
#### 3.Indexed and ordered
#### 4.Can contain duplicates

In [68]:
def division(a,b):
    try:
        return(a/b)
    except:
        return 0

division(10,5)

2.0

In [69]:
def addition(a,b):
    sum = a+b
    return sum

In [70]:
# def functionname(params):
#    func defenition
#    return (optional)

In [71]:
addition(20,10)

30

# Pandas - Panel Data

#### To import any package use the keyword 
### import {pacakge name} as {alias name}

In [85]:
import pandas as pd #importing pacakge pandas as pd

In [86]:
help(pd)

Help on package pandas:

NAME
    pandas

DESCRIPTION
    pandas - a powerful data analysis and manipulation library for Python
    =====================================================================

    **pandas** is a Python package providing fast, flexible, and expressive data
    structures designed to make working with "relational" or "labeled" data both
    easy and intuitive. It aims to be the fundamental high-level building block for
    doing practical, **real world** data analysis in Python. Additionally, it has
    the broader goal of becoming **the most powerful and flexible open source data
    analysis / manipulation tool available in any language**. It is already well on
    its way toward this goal.

    Main Features
    -------------
    Here are just a few of the things that pandas does well:

      - Easy handling of missing data in floating point as well as non-floating
        point data.
      - Size mutability: columns can be inserted and deleted from DataFrame and
        higher dimensional objects
      - Automatic and explicit data alignment: objects can be explicitly aligned
        to a set of labels, or the user can simply ignore the labels and let
        `Series`, `DataFrame`, etc. automatically align the data for you in
        computations.
      - Powerful, flexible group by functionality to perform split-apply-combine
        operations on data sets, for both aggregating and transforming data.
      - Make it easy to convert ragged, differently-indexed data in other Python
        and NumPy data structures into DataFrame objects.
      - Intelligent label-based slicing, fancy indexing, and subsetting of large
        data sets.
      - Intuitive merging and joining data sets.
      - Flexible reshaping and pivoting of data sets.
      - Hierarchical labeling of axes (possible to have multiple labels per tick).
      - Robust IO tools for loading data from flat files (CSV and delimited),
        Excel files, databases, and saving/loading data from the ultrafast HDF5
        format.
      - Time series-specific functionality: date range generation and frequency
        conversion, moving window statistics, date shifting and lagging.

PACKAGE CONTENTS
    _config (package)
    _libs (package)
    _testing
    _typing
    _version
    api (package)
    arrays (package)
    compat (package)
    conftest
    core (package)
    errors (package)
    io (package)
    plotting (package)
    testing
    tests (package)
    tseries (package)
    util (package)

SUBMODULES
    _hashtable
    _lib
    _tslib
    offsets

FUNCTIONS
    __getattr__(name)

DATA
    IndexSlice = <pandas.core.indexing._IndexSlice object>
    NA = <NA>
    NaT = NaT
    __docformat__ = 'restructuredtext'
    __git_version__ = '2a7d3326dee660824a8433ffd01065f8ac37f7d6'
    describe_option = <pandas._config.config.CallableDynamicDoc object>
    get_option = <pandas._config.config.CallableDynamicDoc object>
    options = <pandas._config.config.DictWrapper object>
    reset_option = <pandas._config.config.CallableDynamicDoc object>
    set_option = <pandas._config.config.CallableDynamicDoc object>

VERSION
    1.1.2

FILE
    /Users/christy/opt/anaconda3/lib/python3.8/site-packages/pandas/__init__.py

### Pandas datatypes
#### 1. Series - 1 Dimenesional Data
#### 2. DataFrame - 2 Dimensional Data
#### 3. Panel - 3 Dimesional Data

In [127]:
data = pd.read_csv("data/adult.csv")  #read_excel - to read excel file

In [128]:
type(data)

pandas.core.frame.DataFrame

In [132]:
data.head() #to get the first n number of observations (by default 5)

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K
4,18,?,103497,Some-college,10,Never-married,?,Own-child,White,Female,0,0,30,United-States,<=50K

In [133]:
data.tail()

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
48837,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
48838,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
48839,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
48840,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
48841,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [78]:
#basic functions in pandas

In [134]:
data.shape  #No of Rows,No of columns

(48842, 15)

In [95]:
48842 * 15

732630

In [94]:
data.size  #No of Rows * No of columns

732630

In [96]:
type(data) #to know the type of the object

pandas.core.frame.DataFrame

In [97]:
data.head(3) #to get the first n number of observations (by default 5)

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K

In [98]:
data.tail(3) #to get the last n number of observations (by default 5)

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
48839,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
48840,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
48841,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [103]:
print(data.dtypes) #to check the data types of each column

#dtypes,shape,size,index etc are not functions, they are the features of the dataframe.

age                 int64
workclass          object
fnlwgt              int64
education          object
educational-num     int64
marital-status     object
occupation         object
relationship       object
race               object
gender             object
capital-gain        int64
capital-loss        int64
hours-per-week      int64
native-country     object
income             object
dtype: object

In [135]:
data.shape  #dimension of the dataframe

(48842, 15)

In [104]:
#to get the dimensions (rows,columns)

#to identify the dimensions of data
print("The dataframe has",data.shape[0],"observations(rows) and", data.shape[1],"features(columns)" )

The dataframe has 48842 observations(rows) and 15 features(columns)

In [110]:
data.describe().T #Summary of numerical columns (int64,float64,uint8)

,count,mean,std,min,25%,50%,75%,max
age,48842.0,38.643585,13.710510,17.0,28.0,37.0,48.0,90.0
fnlwgt,48842.0,189664.134597,105604.025423,12285.0,117550.5,178144.5,237642.0,1490400.0
educational-num,48842.0,10.078089,2.570973,1.0,9.0,10.0,12.0,16.0
capital-gain,48842.0,1079.067626,7452.019058,0.0,0.0,0.0,0.0,99999.0
capital-loss,48842.0,87.502314,403.004552,0.0,0.0,0.0,0.0,4356.0
hours-per-week,48842.0,40.422382,12.391444,1.0,40.0,40.0,45.0,99.0

In [111]:
data.describe(include='O').T #Summary of Object columns

                count unique                 top   freq
workclass       48842      9             Private  33906
education       48842     16             HS-grad  15784
marital-status  48842      7  Married-civ-spouse  22379
occupation      48842     15      Prof-specialty   6172
relationship    48842      6             Husband  19716
race            48842      5               White  41762
gender          48842      2                Male  32650
native-country  48842     42       United-States  43832
income          48842      2               <=50K  37155

In [136]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48842 entries, 0 to 48841
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   age              48842 non-null  int64
 1   workclass        48842 non-null  object
 2   fnlwgt           48842 non-null  int64
 3   education        48842 non-null  object
 4   educational-num  48842 non-null  int64
 5   marital-status   48842 non-null  object
 6   occupation       48842 non-null  object
 7   relationship     48842 non-null  object
 8   race             48842 non-null  object
 9   gender           48842 non-null  object
 10  capital-gain     48842 non-null  int64
 11  capital-loss     48842 non-null  int64
 12  hours-per-week   48842 non-null  int64
 13  native-country   48842 non-null  object
 14  income           48842 non-null  object
dtypes: int64(6), object(9)
memory usage: 5.6+ MB

In [137]:
data.columns

Index(['age', 'workclass', 'fnlwgt', 'education', 'educational-num',
       'marital-status', 'occupation', 'relationship', 'race', 'gender',
       'capital-gain', 'capital-loss', 'hours-per-week', 'native-country',
       'income'],
      dtype='object')

In [138]:
data.index

RangeIndex(start=0, stop=48842, step=1)

In [139]:
#checking for the missing value information 
data.isna().sum()

age                0
workclass          0
fnlwgt             0
education          0
educational-num    0
marital-status     0
occupation         0
relationship       0
race               0
gender             0
capital-gain       0
capital-loss       0
hours-per-week     0
native-country     0
income             0
dtype: int64

In [140]:
data.isnull().sum()

age                0
workclass          0
fnlwgt             0
education          0
educational-num    0
marital-status     0
occupation         0
relationship       0
race               0
gender             0
capital-gain       0
capital-loss       0
hours-per-week     0
native-country     0
income             0
dtype: int64

In [116]:
#displaying index  index is also a feature/property
data.index

RangeIndex(start=0, stop=48842, step=1)

In [117]:
#displaying columns it is a feature
data.columns

Index(['age', 'workclass', 'fnlwgt', 'education', 'educational-num',
       'marital-status', 'occupation', 'relationship', 'race', 'gender',
       'capital-gain', 'capital-loss', 'hours-per-week', 'native-country',
       'income'],
      dtype='object')

#### DataFrame Featues


#### index
#### columns
#### shape
#### dtypes
#### size

### Creating a Series

In [90]:
s = pd.Series([1, 3, 5, 6, 8,9,10])

In [91]:
d = pd.DataFrame([1, 3, 5, 6, 8,9,10])

In [92]:
type(s)

pandas.core.series.Series

In [93]:
type(d)

pandas.core.frame.DataFrame

In [94]:
s.shape

(7,)

In [95]:
d.shape

(7, 1)

In [96]:
s

0     1
1     3
2     5
3     6
4     8
5     9
6    10
dtype: int64

In [97]:
d

    0
0   1
1   3
2   5
3   6
4   8
5   9
6  10

In [98]:
s.dtypes

dtype('int64')

In [99]:
s.head()

0    1
1    3
2    5
3    6
4    8
dtype: int64

In [100]:
s.tail()

2     5
3     6
4     8
5     9
6    10
dtype: int64

In [101]:
s.describe()

count     7.000000
mean      6.000000
std       3.265986
min       1.000000
25%       4.000000
50%       6.000000
75%       8.500000
max      10.000000
dtype: float64

In [102]:
s.sum()

42

In [103]:
s1 = pd.Series(["xyz","abcd",'xyz'])
s1

0     xyz
1    abcd
2     xyz
dtype: object

In [104]:
s1.dtypes

dtype('O')

In [105]:
s1.sum()

'xyzabcdxyz'

In [106]:
s2 = pd.Series([123,50,70.25])
s2

0    123.00
1     50.00
2     70.25
dtype: float64

In [107]:
s2.sum()

243.25

In [108]:
s2.dtypes

dtype('float64')

# Creating DataFrame

In [109]:
df1 = pd.DataFrame([1, 3, 5, 6, 8,9,10])

In [110]:
df1

    0
0   1
1   3
2   5
3   6
4   8
5   9
6  10

In [111]:
df1.shape

(7, 1)

In [222]:
input_list = [["A",20,150.5,1],["B",21,155.5,1],["C",22,165.0,0],["D",23,170.2,0],['E',24,172.5,1]]

type(input_list)

list

In [223]:
len(input_list)

5

In [224]:
type(input_list[0])

list

In [225]:
len(input_list[0])

4

In [226]:
df = pd.DataFrame(input_list)
df

   0   1      2  3
0  A  20  150.5  1
1  B  21  155.5  1
2  C  22  165.0  0
3  D  23  170.2  0
4  E  24  172.5  1

In [227]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [228]:
df.columns

RangeIndex(start=0, stop=4, step=1)

In [229]:
#1 Loading existing data
#2 create a DataFrame Programatically

df = pd.DataFrame(input_list,columns=['Name','Age','Height','is graduate?'])

In [230]:
df

  Name  Age  Height  is graduate?
0    A   20   150.5             1
1    B   21   155.5             1
2    C   22   165.0             0
3    D   23   170.2             0
4    E   24   172.5             1

In [231]:
type(df.columns)

pandas.core.indexes.base.Index

In [232]:
df.index = [ x for x in range(1,6)]

In [233]:
df.columns = ['Name','Age','Height','graduated or not?']

In [234]:
df

  Name  Age  Height  graduated or not?
1    A   20   150.5                  1
2    B   21   155.5                  1
3    C   22   165.0                  0
4    D   23   170.2                  0
5    E   24   172.5                  1

In [235]:
df.index

Int64Index([1, 2, 3, 4, 5], dtype='int64')

In [236]:
df.shape

(5, 4)

In [237]:
df.head()

  Name  Age  Height  graduated or not?
1    A   20   150.5                  1
2    B   21   155.5                  1
3    C   22   165.0                  0
4    D   23   170.2                  0
5    E   24   172.5                  1

In [238]:
df.tail()

  Name  Age  Height  graduated or not?
1    A   20   150.5                  1
2    B   21   155.5                  1
3    C   22   165.0                  0
4    D   23   170.2                  0
5    E   24   172.5                  1

In [239]:
df.tail()==df.head()

   Name   Age  Height  graduated or not?
1  True  True    True               True
2  True  True    True               True
3  True  True    True               True
4  True  True    True               True
5  True  True    True               True

In [240]:
df.dtypes

Name                  object
Age                    int64
Height               float64
graduated or not?      int64
dtype: object

In [241]:
df.describe()

             Age      Height  graduated or not?
count   5.000000    5.000000           5.000000
mean   22.000000  162.740000           0.600000
std     1.581139    9.463773           0.547723
min    20.000000  150.500000           0.000000
25%    21.000000  155.500000           0.000000
50%    22.000000  165.000000           1.000000
75%    23.000000  170.200000           1.000000
max    24.000000  172.500000           1.000000

In [242]:
df.describe(include='O')

       Name
count     5
unique    5
top       B
freq      1

In [243]:
df

  Name  Age  Height  graduated or not?
1    A   20   150.5                  1
2    B   21   155.5                  1
3    C   22   165.0                  0
4    D   23   170.2                  0
5    E   24   172.5                  1

In [244]:
gender = ['M','F','F','M','F']

In [245]:
df['Gender']  = gender

In [246]:
df

  Name  Age  Height  graduated or not? Gender
1    A   20   150.5                  1      M
2    B   21   155.5                  1      F
3    C   22   165.0                  0      F
4    D   23   170.2                  0      M
5    E   24   172.5                  1      F

In [247]:
df['Native'] = ['EKM','KTM','TCR','TVM','EKM']

In [248]:
df.describe()

             Age      Height  graduated or not?
count   5.000000    5.000000           5.000000
mean   22.000000  162.740000           0.600000
std     1.581139    9.463773           0.547723
min    20.000000  150.500000           0.000000
25%    21.000000  155.500000           0.000000
50%    22.000000  165.000000           1.000000
75%    23.000000  170.200000           1.000000
max    24.000000  172.500000           1.000000

In [249]:
df.describe(include='O')

       Name Gender Native
count     5      5      5
unique    5      2      4
top       B      F    EKM
freq      1      3      2

In [250]:
df

  Name  Age  Height  graduated or not? Gender Native
1    A   20   150.5                  1      M    EKM
2    B   21   155.5                  1      F    KTM
3    C   22   165.0                  0      F    TCR
4    D   23   170.2                  0      M    TVM
5    E   24   172.5                  1      F    EKM

In [251]:
for i in range(0,5):
    print(i)

0
1
2
3
4

### Access Data from DataFrame

In [252]:
#to access a column

df['Name']

1    A
2    B
3    C
4    D
5    E
Name: Name, dtype: object

In [253]:
df[['Name','Height','Age']]

  Name  Height  Age
1    A   150.5   20
2    B   155.5   21
3    C   165.0   22
4    D   170.2   23
5    E   172.5   24

In [254]:
df.Name

1    A
2    B
3    C
4    D
5    E
Name: Name, dtype: object

In [255]:
df['graduated or not?']

1    1
2    1
3    0
4    0
5    1
Name: graduated or not?, dtype: int64

In [256]:
df.graduated or not?  ## dot operator will not work with space

SyntaxError: invalid syntax (<ipython-input-256-9eeceb506dd0>, line 1)

In [257]:
df.Age

1    20
2    21
3    22
4    23
5    24
Name: Age, dtype: int64

In [258]:
df['Age']

1    20
2    21
3    22
4    23
5    24
Name: Age, dtype: int64

In [259]:
df.Gender

1    M
2    F
3    F
4    M
5    F
Name: Gender, dtype: object

In [260]:
df['Gender']

1    M
2    F
3    F
4    M
5    F
Name: Gender, dtype: object

In [261]:
df

  Name  Age  Height  graduated or not? Gender Native
1    A   20   150.5                  1      M    EKM
2    B   21   155.5                  1      F    KTM
3    C   22   165.0                  0      F    TCR
4    D   23   170.2                  0      M    TVM
5    E   24   172.5                  1      F    EKM

In [262]:
#to acess row we need to specify the row index.
#loc means location -we are specifying the location by index.

df.loc[1]

Name                     A
Age                     20
Height               150.5
graduated or not?        1
Gender                   M
Native                 EKM
Name: 1, dtype: object

In [263]:
df.loc[0]

KeyError: 0

In [264]:
df.loc[[1,2,3]]

  Name  Age  Height  graduated or not? Gender Native
1    A   20   150.5                  1      M    EKM
2    B   21   155.5                  1      F    KTM
3    C   22   165.0                  0      F    TCR

In [265]:
df.index = df['Name']  #I am changing the index into Name

In [266]:
df

     Name  Age  Height  graduated or not? Gender Native
Name
A       A   20   150.5                  1      M    EKM
B       B   21   155.5                  1      F    KTM
C       C   22   165.0                  0      F    TCR
D       D   23   170.2                  0      M    TVM
E       E   24   172.5                  1      F    EKM

In [267]:
df.loc['A']

Name                     A
Age                     20
Height               150.5
graduated or not?        1
Gender                   M
Native                 EKM
Name: A, dtype: object

In [268]:
df.loc[['A','B','C']] #in loc function we are providing the actual index.

     Name  Age  Height  graduated or not? Gender Native
Name
A       A   20   150.5                  1      M    EKM
B       B   21   155.5                  1      F    KTM
C       C   22   165.0                  0      F    TCR

In [273]:
df.loc[['A','A']]

     Name  Age  Height  graduated or not? Gender Native
Name
A       A   20   150.5                  1      M    EKM
A       A   20   150.5                  1      M    EKM

In [269]:
df.iloc[0]

Name                     A
Age                     20
Height               150.5
graduated or not?        1
Gender                   M
Native                 EKM
Name: A, dtype: object

In [272]:
df.iloc[[0,0]]

     Name  Age  Height  graduated or not? Gender Native
Name
A       A   20   150.5                  1      M    EKM
A       A   20   150.5                  1      M    EKM

In [271]:
df.iloc[0:3]

     Name  Age  Height  graduated or not? Gender Native
Name
A       A   20   150.5                  1      M    EKM
B       B   21   155.5                  1      F    KTM
C       C   22   165.0                  0      F    TCR

In [274]:
df

     Name  Age  Height  graduated or not? Gender Native
Name
A       A   20   150.5                  1      M    EKM
B       B   21   155.5                  1      F    KTM
C       C   22   165.0                  0      F    TCR
D       D   23   170.2                  0      M    TVM
E       E   24   172.5                  1      F    EKM

In [275]:
#iloc function accept range index. ie (0,1,2,...)

df.iloc[[0,1,2],[0,1]]

     Name  Age
Name
A       A   20
B       B   21
C       C   22

In [276]:
df.loc[['A','B','C'],['Name','Age']]

     Name  Age
Name
A       A   20
B       B   21
C       C   22

In [278]:
#To access a cell using loc

df.loc['A','Age']

20

In [279]:
df.loc['A','Age']  = 15

In [280]:
df

     Name  Age  Height  graduated or not? Gender Native
Name
A       A   15   150.5                  1      M    EKM
B       B   21   155.5                  1      F    KTM
C       C   22   165.0                  0      F    TCR
D       D   23   170.2                  0      M    TVM
E       E   24   172.5                  1      F    EKM

In [281]:
df.loc['A','Age']

15

In [282]:
#To access a cell using iloc

df.iloc[0,1]

15

In [283]:
df

     Name  Age  Height  graduated or not? Gender Native
Name
A       A   15   150.5                  1      M    EKM
B       B   21   155.5                  1      F    KTM
C       C   22   165.0                  0      F    TCR
D       D   23   170.2                  0      M    TVM
E       E   24   172.5                  1      F    EKM

In [284]:
df.index = df['Gender']

In [285]:
df

       Name  Age  Height  graduated or not? Gender Native
Gender
M         A   15   150.5                  1      M    EKM
F         B   21   155.5                  1      F    KTM
F         C   22   165.0                  0      F    TCR
M         D   23   170.2                  0      M    TVM
F         E   24   172.5                  1      F    EKM

In [286]:
df.iloc[0]

Name                     A
Age                     15
Height               150.5
graduated or not?        1
Gender                   M
Native                 EKM
Name: M, dtype: object

In [287]:
df.loc['F']

       Name  Age  Height  graduated or not? Gender Native
Gender
F         B   21   155.5                  1      F    KTM
F         C   22   165.0                  0      F    TCR
F         E   24   172.5                  1      F    EKM

In [168]:
#duplicate index
#1 Loading existing data
#2 create a DataFrame Programatically

df1 = pd.DataFrame([["A",20],["B",21],["C",22],["D",23],['A',24]],columns=['Name','Age'])

In [169]:
df1

  Name  Age
0    A   20
1    B   21
2    C   22
3    D   23
4    A   24

In [170]:
df1.index = df1['Name']

In [171]:
df1

     Name  Age
Name
A       A   20
B       B   21
C       C   22
D       D   23
A       A   24

In [172]:
df1.loc['A']

     Name  Age
Name
A       A   20
A       A   24

In [173]:
df

       Name  Age  Height  graduated or not? Gender Native
Gender
M         A   15   150.5                  1      M    EKM
F         B   21   155.5                  1      F    KTM
F         C   22   165.0                  0      F    TCR
M         D   23   170.2                  0      M    TVM
F         E   24   172.5                  1      F    EKM

### Delete rows and columns from DataFrame

In [288]:
#for deleting rows and columns we use function called 'drop'

#we have to specify the axis 
#Axis=0 for rows
#Axis=1 for columns

df = df.drop('B',axis=0) #default value for axis is 0.

KeyError: "['B'] not found in axis"

In [289]:
df

       Name  Age  Height  graduated or not? Gender Native
Gender
M         A   15   150.5                  1      M    EKM
F         B   21   155.5                  1      F    KTM
F         C   22   165.0                  0      F    TCR
M         D   23   170.2                  0      M    TVM
F         E   24   172.5                  1      F    EKM

In [290]:
df = df.drop('Height',axis=1)

In [295]:
df

       Name  Age  graduated or not? Gender Native
Gender
F         B   21                  1      F    KTM
F         C   22                  0      F    TCR
F         E   24                  1      F    EKM

In [294]:
df = df.drop('M',axis=0)

In [296]:
df_cp = df.copy()

In [297]:
df_cp

       Name  Age  graduated or not? Gender Native
Gender
F         B   21                  1      F    KTM
F         C   22                  0      F    TCR
F         E   24                  1      F    EKM

In [298]:
del df_cp

In [299]:
df_cp.head()

NameError: name 'df_cp' is not defined

In [300]:
df_cp

NameError: name 'df_cp' is not defined

In [301]:
df_cp = df.copy()
df_cp

       Name  Age  graduated or not? Gender Native
Gender
F         B   21                  1      F    KTM
F         C   22                  0      F    TCR
F         E   24                  1      F    EKM

In [302]:
df_cp.drop(['Age','Gender'],axis=1)

       Name  graduated or not? Native
Gender
F         B                  1    KTM
F         C                  0    TCR
F         E                  1    EKM

In [304]:
del df['Native'] #del command is an alternative to delete columns

In [306]:
df

       Name  Age  graduated or not? Gender
Gender
F         B   21                  1      F
F         C   22                  0      F
F         E   24                  1      F

In [307]:
df.drop('Age',axis=1,inplace=True)

/Users/christy/opt/anaconda3/lib/python3.8/site-packages/pandas/core/frame.py:4162: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

In [309]:
df

       Name  graduated or not? Gender
Gender
F         B                  1      F
F         C                  0      F
F         E                  1      F

In [312]:
df.reset_index(drop=True)

  Name  graduated or not? Gender
0    B                  1      F
1    C                  0      F
2    E                  1      F

In [188]:
#mathematical functions/ statistical functions

In [313]:
data.head()

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K
4,18,?,103497,Some-college,10,Never-married,?,Own-child,White,Female,0,0,30,United-States,<=50K

In [314]:
#to calculate the mean
avg_val = data["age"].mean()
avg_val

38.64358543876172

In [315]:
#to calculate the median
median_val = data['age'].median()
type(median_val)

float

In [316]:
# to calculate the mode
mode_val = data['gender'].mode()
mode_val

0    Male
dtype: object

In [317]:
#to calculate the std
stdev = data['age'].std()
stdev

13.71050993444322

In [318]:
#standard deviation
data['age'].std()

13.71050993444322

In [319]:
#standard deviation
data['age'].var()

187.97808266246622

In [320]:
test_series = pd.Series([70,75,60,60,62,85,90,45,50,93])

In [321]:
test_series

0    70
1    75
2    60
3    60
4    62
5    85
6    90
7    45
8    50
9    93
dtype: int64

In [322]:
test_series.dtypes

dtype('int64')

In [323]:
test_series.shape

(10,)

In [324]:
test_series.sum()

690

In [325]:
cal_mean  = 690/10
cal_mean

69.0

In [326]:
test_series.mean()

69.0

In [327]:
test_series.median()

66.0

In [328]:
test_series.mode()

0    60
dtype: int64

In [329]:
test_series.std()

16.526073674987387

In [330]:
test_series.var()

273.1111111111111

In [331]:
#to calculate the median we are sorting the series
ts = test_series.sort_values()
ts= ts.reset_index(drop=True)
ts

0    45
1    50
2    60
3    60
4    62
5    70
6    75
7    85
8    90
9    93
dtype: int64

In [332]:
cal_median = (62+70)/2
cal_median

66.0

In [333]:
test_series.median()

66.0

In [334]:
calc_mode = 60

In [335]:
test_series.mode()

0    60
dtype: int64

In [336]:
test_series.std()

16.526073674987387

In [337]:
test_series.var()

273.1111111111111

In [338]:
data['gender'].mode()

0    Male
dtype: object

In [339]:

#with nan value  --   in calculation null values are omited
import numpy as np
test_series = pd.Series([70,70,75,75,60,60,62,85,90,45,50,93,np.nan])
test_series

0     70.0
1     70.0
2     75.0
3     75.0
4     60.0
5     60.0
6     62.0
7     85.0
8     90.0
9     45.0
10    50.0
11    93.0
12     NaN
dtype: float64

In [340]:
test_series.isna().sum()

1

In [341]:
test_series.mean()

69.58333333333333

In [342]:
test_series.mode()

0    60.0
1    70.0
2    75.0
dtype: float64

In [343]:
test_series.median()

70.0

In [344]:
test_series.std()

15.048155026346908

In [345]:
test_series.var()

226.44696969696972

# END